# Adventureworks Product Sales and Customer Behaviour Analysis

## Overview
This project consists of SQL queries designed to analyze, report, and maintain data within the **AdventureWorks database**. The project covers:
- **Comprehensive product reporting**
- **Customer and order insights**
- **Product category hierarchy analysis**
- **Advanced sales analysis and aggregation**
- **Data maintenance and updates**

The SQL scripts handle missing data, optimize performance, and provide insights tailored for business decision-making.

## Connection setup and libraries Import

In [1]:
import numpy as np
import pandas as pd
import sys
import os

In [5]:
%load_ext sql
%sql mssql+pyodbc://AH-PC/AdventureWorksLT2022?driver=ODBC+Driver+17+for+SQL+Server&Trusted_Connection=yes&TrustServerCertificate=yes

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'mssql+pyodbc://AH-PC/AdventureWorksLT2022?TrustServerCertificate=yes&Trusted_Connection=yes&driver=ODBC+Driver+17+for+SQL+Server'

In [7]:
%%sql
SELECT TABLE_SCHEMA, TABLE_NAME, COLUMN_NAME, DATA_TYPE
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_SCHEMA = 'SalesLT'
    --AND TABLE_NAME='Customer'
 
ORDER BY TABLE_SCHEMA, TABLE_NAME, ORDINAL_POSITION;

Running query in 'mssql+pyodbc://AH-PC/AdventureWorksLT2022?TrustServerCertificate=yes&Trusted_Connection=yes&driver=ODBC+Driver+17+for+SQL+Server'

+--------------+------------+---------------+------------------+
| TABLE_SCHEMA | TABLE_NAME |  COLUMN_NAME  |    DATA_TYPE     |
+--------------+------------+---------------+------------------+
|   SalesLT    |  Address   |   AddressID   |       int        |
|   SalesLT    |  Address   |  AddressLine1 |     nvarchar     |
|   SalesLT    |  Address   |  AddressLine2 |     nvarchar     |
|   SalesLT    |  Address   |      City     |     nvarchar     |
|   SalesLT    |  Address   | StateProvince |     nvarchar     |
|   SalesLT    |  Address   | CountryRegion |     nvarchar     |
|   SalesLT    |  Address   |   PostalCode  |     nvarchar     |
|   SalesLT    |  Address   |    rowguid    | uniqueidentifier |
|   SalesLT    |  Address   |  ModifiedDate |     datetime     |
|   SalesLT    |  Customer  |   CustomerID  |       int        |
+--------------+------------+---------------+------------------+
Truncated to displaylimit of 10.

## Reports & Analysis

### **1. Comprehensive Product Reporting**

**<u>Business Need:**  
The product managers need a detailed product overview, including basic details, attributes, pricing, and profit margins to track performance.

In [26]:
%%sql
-- tasks:
-- First, we need to list all products, including name, product number, cost, and price.
-- Next, we calculate markup and combine color and size into a single field.
-- Finally, we ensure missing values (like color or size) are clearly indicated.

SELECT top 100
    ProductID,
    Name AS ProductName,
    ProductNumber,
    StandardCost,
    ListPrice,
    (ListPrice - StandardCost) AS Markup,
    COALESCE(NULLIF(Color, ''), 'No Color') + ' ' + COALESCE(NULLIF(Size, ''), 'No Size') AS FullProductDescription,
    CASE 
        WHEN ListPrice < 50 THEN 'Low'
        WHEN ListPrice BETWEEN 50 AND 500 THEN 'Medium'
        ELSE 'High'
    END AS PriceCategory
FROM SalesLT.Product
ORDER BY ListPrice DESC;

,ProductID,ProductName,ProductNumber,StandardCost,ListPrice,Markup,FullProductDescription,PriceCategory
0,753,"Road-150 Red, 56",BK-R93R-56,2171.2942,3578.2700,1406.9758,Red 56,High
1,752,"Road-150 Red, 52",BK-R93R-52,2171.2942,3578.2700,1406.9758,Red 52,High
2,751,"Road-150 Red, 48",BK-R93R-48,2171.2942,3578.2700,1406.9758,Red 48,High
3,750,"Road-150 Red, 44",BK-R93R-44,2171.2942,3578.2700,1406.9758,Red 44,High
4,749,"Road-150 Red, 62",BK-R93R-62,2171.2942,3578.2700,1406.9758,Red 62,High
...,...,...,...,...,...,...,...,...
95,761,"Road-650 Red, 62",BK-R50R-62,486.7066,782.9900,296.2834,Red 62,High
96,760,"Road-650 Red, 60",BK-R50R-60,486.7066,782.9900,296.2834,Red 60,High
97,759,"Road-650 Red, 58",BK-R50R-58,486.7066,782.9900,296.2834,Red 58,High
98,980,"Mountain-400-W Silver, 38",BK-M38S-38,419.7784,769.4900,349.7116,Silver 38,High
99,981,"Mountain-400-W Silver, 40",BK-M38S-40,419.7784,769.4900,349.7116,Silver 40,High

### **2. Customer and Order Insights**

**Business Need:**  
The sales team wants a full view of customers and their orders, including contact details and non-buying customers for targeted outreach.

In [19]:
%%sql

-- tasks:
--  First, we need to create a customer profile report with full names, company names, and primary contact details in a clear, readable format.
-- Next, we generate order summaries, listing order IDs, dates, and total due amounts (including item subtotals, taxes, and freight).
-- Finally, we ensure that missing customer or order details are clearly indicated, preventing errors or blank fields.
SELECT top 100
    c.CustomerID,
    COALESCE(c.Title + ' ', '') + c.FirstName + ' ' + COALESCE(c.MiddleName + ' ', '') + c.LastName AS FullCustomerName,
    c.CompanyName,
    COALESCE(NULLIF(c.EmailAddress, ''), c.Phone, 'No Contact Info') AS PrimaryContact,
    COUNT(oh.SalesOrderID) AS NumberOfOrders,
    COALESCE(SUM(oh.SubTotal + oh.TaxAmt + oh.Freight), 0) AS TotalRevenue
FROM SalesLT.Customer AS c
LEFT JOIN SalesLT.SalesOrderHeader AS oh
    ON c.CustomerID = oh.CustomerID
GROUP BY c.CustomerID, c.Title, c.FirstName, c.MiddleName, c.LastName, c.CompanyName, c.EmailAddress, c.Phone
ORDER BY NumberOfOrders DESC;

Traceback (most recent call last):
  File "D:\anaconda3\Lib\site-packages\sql\magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\Lib\site-packages\sql\connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### **3. Product Category and Hierarchy Analysis**

**Business Need:**  
Marketing needs a structured view of product categories, showing main categories, subcategories, and product distribution.

In [21]:
%%sql
-- Tasks:
-- we need to create a category listing that displays each product category along with its subcategories and lists all products within them.
-- Next, we ensure the report clearly shows parent-child relationships, making it easy to see how main categories and subcategories are structured (e.g., “Bikes” → “Mountain Bikes”).

SELECT top 100
    COALESCE(pcat.Name, 'Uncategorized') AS ParentCategory,
    COALESCE(cat.Name, 'No Subcategory') AS SubCategory,
    COUNT(p.ProductID) AS TotalProducts
FROM SalesLT.ProductCategory AS cat
LEFT JOIN SalesLT.ProductCategory AS pcat
    ON cat.ParentProductCategoryID = pcat.ProductCategoryID
LEFT JOIN SalesLT.Product AS p
    ON cat.ProductCategoryID = p.ProductCategoryID
GROUP BY pcat.Name, cat.Name
ORDER BY ParentCategory, SubCategory;

Traceback (most recent call last):
  File "D:\anaconda3\Lib\site-packages\sql\magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\Lib\site-packages\sql\connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### **4. Advanced Sales Analysis and Aggregation**

**Business Need:**  
The sales team requested summary reports on sales performance, including total sales, average sales per product, and top-performing items.

In [110]:
%%sql
-- Task_1:
-- First, we need to aggregate sales by product, summing up the total units sold per product and ordering the results from highest to lowest sales.
-- Next, we create a sales summary by salesperson, showing total revenue and the number of customers managed.
-- Excluding salespeople below a set customer threshold.
-- We ensure flexible filtering, allowing reports to be refined based on price thresholds, date ranges, or other conditions.
    p.ProductID,
    p.Name AS ProductName,
    p.ListPrice,
    SUM(od.OrderQty) AS TotalUnitsSold,
    AVG(od.UnitPrice) AS AverageSellingPrice
FROM SalesLT.Product AS p
JOIN SalesLT.SalesOrderDetail AS od
    ON p.ProductID = od.ProductID
WHERE p.ListPrice > 1000
GROUP BY p.ProductID, p.Name, p.ListPrice
HAVING SUM(od.OrderQty) > 20
ORDER BY TotalUnitsSold DESC;

 * mssql+pyodbc://adventureworks-db:***@adventureworks-db.database.windows.net:1433/AdventureWorks?driver=ODBC+Driver+18+for+SQL+Server
Done.

[(976, 'Road-350-W Yellow, 48', Decimal('1700.9900'), 42, Decimal('986.5742')),
 (783, 'Mountain-200 Black, 42', Decimal('2294.9900'), 27, Decimal('1376.9940')),
 (969, 'Touring-1000 Blue, 60', Decimal('2384.0700'), 26, Decimal('1430.4420')),
 (782, 'Mountain-200 Black, 38', Decimal('2294.9900'), 26, Decimal('1376.9940'))]

### **5. Data Maintenance and Updates**

**Business Need:**  
Operations require regular updates on product and category data, including adding new products, updating prices, and removing outdated items.

In [4]:
%%sql
-- task_1:
--  Add a new product ("LED Lights") to the products table with today’s date as the start of its selling period. 
-- After inserting, confirm the newly generated product identifier.

INSERT INTO SalesLT.Product (Name, ProductNumber, StandardCost, ListPrice, ProductCategoryID, SellStartDate)
VALUES
    ('LED Lights', 'LT-L123', 2.56, 12.99, 37, GETDATE());
COMMIT;
SELECT SCOPE_IDENTITY() AS NewProductID;

 * mssql+pyodbc://adventureworks-db:***@adventureworks-db.database.windows.net:1433/AdventureWorks?driver=ODBC+Driver+18+for+SQL+Server
1 rows affected.
Done.
Done.

[(Decimal('1000'),)]

In [7]:
%%sql
-- task_2:
-- Introduce a new product category ("Bells and Horns") and add two new products under this category.

-- Insert new category
INSERT INTO SalesLT.ProductCategory (ParentProductCategoryID, Name)
VALUES (4, 'Bells and Horns');

-- Insert products into the new category using IDENT_CURRENT
INSERT INTO SalesLT.Product (Name, ProductNumber, StandardCost, ListPrice, ProductCategoryID, SellStartDate)
VALUES 
    ('Bicycle Bell', 'BB-RING', 2.47, 4.99, IDENT_CURRENT('SalesLT.ProductCategory'), GETDATE()),
    ('Bicycle Horn', 'BH-PARP', 1.29, 3.75, IDENT_CURRENT('SalesLT.ProductCategory'), GETDATE());

-- Commit the transaction
COMMIT;

-- Verify insertion
SELECT * FROM SalesLT.Product WHERE ProductCategoryID = IDENT_CURRENT('SalesLT.ProductCategory');

 * mssql+pyodbc://adventureworks-db:***@adventureworks-db.database.windows.net:1433/AdventureWorks?driver=ODBC+Driver+18+for+SQL+Server
1 rows affected.
2 rows affected.
Done.
Done.

[(1001, 'Bicycle Bell', 'BB-RING', None, Decimal('2.4700'), Decimal('4.9900'), None, None, 45, None, datetime.datetime(2025, 2, 6, 8, 58, 58, 800000), None, None, None, None, '2F42C1F8-8E16-40D4-8407-1869B3A1960B', datetime.datetime(2025, 2, 6, 8, 58, 58, 800000)),
 (1002, 'Bicycle Horn', 'BH-PARP', None, Decimal('1.2900'), Decimal('3.7500'), None, None, 45, None, datetime.datetime(2025, 2, 6, 8, 58, 58, 800000), None, None, None, None, 'ADA4D1B9-6DC5-49D2-A6D6-5B854DDABF83', datetime.datetime(2025, 2, 6, 8, 58, 58, 800000))]

In [8]:
%%sql
-- task_3:
-- Implement a price adjustment across a category—such as increasing prices for all products in the “Bells and Horns” category by 10%.

UPDATE SalesLT.Product
SET ListPrice = ListPrice * 1.1
WHERE ProductCategoryID = (
    SELECT ProductCategoryID FROM SalesLT.ProductCategory WHERE Name = 'Bells and Horns'
)
-- Commit the transaction
COMMIT;

 * mssql+pyodbc://adventureworks-db:***@adventureworks-db.database.windows.net:1433/AdventureWorks?driver=ODBC+Driver+18+for+SQL+Server
2 rows affected.

[]

In [9]:
%%sql
-- task_4:
-- Mark certain products as discontinued (by setting a discontinuation date) while preserving current records.
UPDATE SalesLT.Product
SET DiscontinuedDate = GETDATE()
WHERE ProductCategoryID = 37 AND ProductNumber <> 'LT-L123';
COMMIT;

 * mssql+pyodbc://adventureworks-db:***@adventureworks-db.database.windows.net:1433/AdventureWorks?driver=ODBC+Driver+18+for+SQL+Server
3 rows affected.
Done.

[]

In [10]:
%%sql
-- task_5:
-- Remove a product category that is no longer viable along with its associated products,
-- taking care to ensure that the deletion respects our data integrity constraints.

-- First, delete products linked to the category
DELETE FROM SalesLT.Product
WHERE ProductCategoryID = (
    SELECT ProductCategoryID FROM SalesLT.ProductCategory WHERE Name = 'Bells and Horns'
)
;
-- Now delete the category itself
DELETE FROM SalesLT.ProductCategory
WHERE Name = 'Bells and Horns';
COMMIT;

 * mssql+pyodbc://adventureworks-db:***@adventureworks-db.database.windows.net:1433/AdventureWorks?driver=ODBC+Driver+18+for+SQL+Server
2 rows affected.
1 rows affected.
Done.

[]